org-init.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Configuration</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Emacs Configuration"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-12 17:34:52 IST"/>
<meta name="author" content="Daniel Szmulewicz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Emacs Configuration</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 UTF-8</a></li>
<li><a href="#sec-2">2 Tabs</a></li>
<li><a href="#sec-3">3 Color theme</a></li>
<li><a href="#sec-4">4 Menu bar</a></li>
<li><a href="#sec-5">5 Winner mode</a></li>
<li><a href="#sec-6">6 Windmove</a></li>
<li><a href="#sec-7">7 Recent file list</a></li>
<li><a href="#sec-8">8 Ido</a></li>
<li><a href="#sec-9">9 Fixes</a></li>
<li><a href="#sec-10">10 Elpa</a></li>
<li><a href="#sec-11">11 El-get</a>
<ul>
<li><a href="#sec-11-1">11.1 Installation routine</a></li>
<li><a href="#sec-11-2">11.2 Recipe setup</a></li>
<li><a href="#sec-11-3">11.3 User setup</a></li>
</ul>
</li>
<li><a href="#sec-12">12 Text-files hooks</a></li>
<li><a href="#sec-13">13 Org-mode</a>
<ul>
<li><a href="#sec-13-1">13.1 Org-babel</a></li>
<li><a href="#sec-13-2">13.2 Org-velocity</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> UTF-8</h2>
<div class="outline-text-2" id="text-1">

<p>We want to have default utf-8 everything.
</p>


<pre class="src src-emacs-lisp">(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Tabs</h2>
<div class="outline-text-2" id="text-2">

<p>Two-width tab stops, like I'm used to
</p>


<pre class="src src-emacs-lisp">(setq tab-width 2)
(setq tab-stop-list (number-sequence 2 200 2))
(setq indent-tabs-mode nil)
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Color theme</h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-emacs-lisp">(load-theme 'adwaita t)
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Menu bar</h2>
<div class="outline-text-2" id="text-4">

<p>Disable it
</p>


<pre class="src src-emacs-lisp">(menu-bar-mode 0)
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Winner mode</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-emacs-lisp">(winner-mode 1)
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Windmove</h2>
<div class="outline-text-2" id="text-6">




<pre class="src src-emacs-lisp">(<span style="color: #A52A2A; font-weight: bold;">when</span> (fboundp 'windmove-default-keybindings)
     (windmove-default-keybindings))
</pre>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Recent file list</h2>
<div class="outline-text-2" id="text-7">




<pre class="src src-emacs-lisp">(<span style="color: #A52A2A; font-weight: bold;">require</span> '<span style="color: #F5666D;">recentf</span>)
(recentf-mode 1)
</pre>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Ido</h2>
<div class="outline-text-2" id="text-8">




<pre class="src src-emacs-lisp">(setq ido-enable-flex-matching t)
(setq ido-everywhere t)
(ido-mode 1)
</pre>


<p>
Get rid of `find-file-read-only' and replace it with something more useful.
</p>


<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #4E9A06;">"C-x C-r"</span>) 'ido-recentf-open)
</pre>


<p>
Make recentf use ido
</p>


<pre class="src src-emacs-lisp">(<span style="color: #A52A2A; font-weight: bold;">defun</span> <span style="color: #00578E; font-weight: bold;">ido-recentf-open</span> () 
  <span style="color: #4E9A06;">"Use `</span><span style="color: #F5666D;">ido-completing-read</span><span style="color: #4E9A06;">' to \\[</span><span style="color: #F5666D;">find-file</span><span style="color: #4E9A06;">] a recent file"</span> 
  (interactive) 
  (<span style="color: #A52A2A; font-weight: bold;">if</span> (find-file (ido-completing-read <span style="color: #4E9A06;">"Find recent file: "</span> recentf-list)) 
      (message <span style="color: #4E9A06;">"Opening file..."</span>) 
    (message <span style="color: #4E9A06;">"Aborting"</span>)))
</pre>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Fixes</h2>
<div class="outline-text-2" id="text-9">

<p>Fix the bug that shift-up doesn't send the right escape sequence in terminal
</p>



<pre class="src src-emacs-lisp">(<span style="color: #A52A2A; font-weight: bold;">if</span> (equal <span style="color: #4E9A06;">"xterm-256color"</span> (tty-type)) (define-key input-decode-map <span style="color: #4E9A06;">"\e[1;2A"</span> [S-up]))
</pre>


<p>
To make windmove work in tmux
</p>


<pre class="src src-emacs-lisp">(<span style="color: #A52A2A; font-weight: bold;">if</span> (equal <span style="color: #4E9A06;">"screen-256color"</span> (tty-type)) 
    (<span style="color: #A52A2A; font-weight: bold;">progn</span>
    (define-key input-decode-map <span style="color: #4E9A06;">"\e[1;2D"</span> [S-left])  
    (define-key input-decode-map (kbd <span style="color: #4E9A06;">"M-[ 1 ; 2 C"</span>) [S-right])  
    (define-key input-decode-map (kbd <span style="color: #4E9A06;">"M-[ 1 ; 2 B"</span>)[S-down])  
    (define-key input-decode-map <span style="color: #4E9A06;">"\e[1;2A"</span> [S-up])  
    (define-key input-decode-map <span style="color: #4E9A06;">"\e[1;6A"</span> [S-C-up])
    (define-key input-decode-map <span style="color: #4E9A06;">"\e[1;6B"</span> [S-C-down])))

</pre>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Elpa</h2>
<div class="outline-text-2" id="text-10">


<p>
Repositories
</p>


<pre class="src src-emacs-lisp">(setq package-archives '((<span style="color: #4E9A06;">"gnu"</span> . <span style="color: #4E9A06;">"http://elpa.gnu.org/packages/"</span>)
                         (<span style="color: #4E9A06;">"marmalade"</span> . <span style="color: #4E9A06;">"http://marmalade-repo.org/packages/"</span>)
                         (<span style="color: #4E9A06;">"tromey"</span> . <span style="color: #4E9A06;">"http://tromey.com/elpa/"</span>)
                         (<span style="color: #4E9A06;">"melpa"</span> . <span style="color: #4E9A06;">"http://melpa.milkbox.net/packages/"</span>)
                         (<span style="color: #4E9A06;">"org"</span> . <span style="color: #4E9A06;">"http://orgmode.org/elpa/"</span>)))
</pre>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> El-get</h2>
<div class="outline-text-2" id="text-11">



</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Installation routine</h3>
<div class="outline-text-3" id="text-11-1">





<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #4E9A06;">"~/.emacs.d/el-get/el-get"</span>)

(<span style="color: #A52A2A; font-weight: bold;">unless</span> 
    (<span style="color: #A52A2A; font-weight: bold;">require</span> '<span style="color: #F5666D;">el-get</span> nil t) 
  (url-retrieve <span style="color: #4E9A06;">"https://raw.github.com/dimitri/el-get/master/el-get-install.el"</span> 
  (<span style="color: #A52A2A; font-weight: bold;">lambda</span> (s) 
    (<span style="color: #A52A2A; font-weight: bold;">let</span> (el-get-master-branch)
      (goto-char (point-max)) 
        (eval-print-last-sexp)))))
</pre>


</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Recipe setup</h3>
<div class="outline-text-3" id="text-11-2">

<p>Canonical list of packages
</p>


<pre class="src src-emacs-lisp">(setq my-packages (append '(el-get ack yasnippet
                            zenburn-theme solarized-theme 
                            ruby-mode inf-ruby rspec-mode
                            auto-complete auto-complete-emacs-lisp auto-complete-yasnippet
                            anything anything-rcodetools emacs-w3m yaml-mode windcycle
                            go-mode 
                            coffee-mode markdown-mode less-css-mode scss-mode mustache-mode
                            clojure-mode clojurescript-mode midje-mode nrepl htmlize paredit kibit-mode
                            epresent org-html5presentation org-impress-js org-s5
                            palimpsest-mode) 
                          (mapcar 'el-get-source-name el-get-sources)))
(el-get-cleanup my-packages)
(el-get 'sync my-packages)
</pre>


</div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> User setup</h3>
<div class="outline-text-3" id="text-11-3">




<pre class="src src-emacs-lisp">(setq el-get-sources '((<span style="color: #A020F0;">:name</span> magit 
                        <span style="color: #A020F0;">:after</span> (global-set-key (kbd <span style="color: #4E9A06;">"C-x C-o"</span>) 'magit-status))
                       (<span style="color: #A020F0;">:name</span> ruby-mode
                        <span style="color: #A020F0;">:after</span> (<span style="color: #A52A2A; font-weight: bold;">when</span> (string= system-name <span style="color: #4E9A06;">"ma.sdf.org"</span>) (setq enh-ruby-program <span style="color: #4E9A06;">"ruby193"</span>)))
                       (<span style="color: #A020F0;">:name</span> elisp-format 
                        <span style="color: #A020F0;">:features</span> elisp-format)))
</pre>

</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Text-files hooks</h2>
<div class="outline-text-2" id="text-12">

<p>Turn visual mode for text files
</p>


<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook 'turn-on-visual-line-mode)
</pre>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Org-mode</h2>
<div class="outline-text-2" id="text-13">




<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #4E9A06;">"~/.emacs.d/el-get/package/elpa/org-20130311"</span>)
(add-to-list 'load-path <span style="color: #4E9A06;">"~/.emacs.d/el-get/package/elpa/org-plus-contrib-20130311"</span>)
</pre>



</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Org-babel</h3>
<div class="outline-text-3" id="text-13-1">


<p>
org-babel setup
</p>


<pre class="src src-emacs-lisp">(<span style="color: #A52A2A; font-weight: bold;">when</span> (locate-file <span style="color: #4E9A06;">"ob"</span> load-path load-suffixes)
                                           (<span style="color: #A52A2A; font-weight: bold;">require</span> '<span style="color: #F5666D;">ob</span>)
                                           (<span style="color: #A52A2A; font-weight: bold;">require</span> '<span style="color: #F5666D;">ob-tangle</span>)
                                           (add-to-list 'org-babel-tangle-lang-exts '(<span style="color: #4E9A06;">"clojure"</span> . <span style="color: #4E9A06;">"clj"</span>))

                                           (org-babel-do-load-languages
                                            'org-babel-load-languages
                                            '((emacs-lisp . t)
                                              (clojure . t)
                                              (js . t)
                                              (ruby . t)))


                                           (<span style="color: #A52A2A; font-weight: bold;">defun</span> <span style="color: #00578E; font-weight: bold;">org-babel-execute:clojure</span> (body params)
                                             <span style="color: #4E9A06;">"Evaluate a block of Clojure code with Babel."</span>
                                             (<span style="color: #A52A2A; font-weight: bold;">let*</span> ((result (nrepl-send-string-sync body (nrepl-current-ns)))
                                                    (value (plist-get result <span style="color: #A020F0;">:value</span>))
                                                    (out (plist-get result <span style="color: #A020F0;">:stdout</span>))
                                                    (out (<span style="color: #A52A2A; font-weight: bold;">when</span> out
                                                           (<span style="color: #A52A2A; font-weight: bold;">if</span> (string= <span style="color: #4E9A06;">"\n"</span> (substring out -1))
                                                               (substring out 0 -1)
                                                             out)))
                                                    (stdout (<span style="color: #A52A2A; font-weight: bold;">when</span> out
                                                              (mapconcat (<span style="color: #A52A2A; font-weight: bold;">lambda</span> (line)
                                                                           (concat <span style="color: #4E9A06;">";; "</span> line))
                                                                         (split-string out <span style="color: #4E9A06;">"\n"</span>)
                                                                         <span style="color: #4E9A06;">"\n"</span>))))
                                               (concat stdout
                                                       (<span style="color: #A52A2A; font-weight: bold;">when</span> (and stdout (not (string= <span style="color: #4E9A06;">"\n"</span> (substring stdout -1))))
                                                         <span style="color: #4E9A06;">"\n"</span>)
                                                       <span style="color: #4E9A06;">";;=&gt; "</span> value)))

                                           (<span style="color: #A52A2A; font-weight: bold;">provide</span> '<span style="color: #F5666D;">ob-clojure</span>)

                                           (setq org-src-fontify-natively t)
                                           (setq org-confirm-babel-evaluate nil))

</pre>


</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Org-velocity</h3>
<div class="outline-text-3" id="text-13-2">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #4E9A06;">"C-c v"</span>) 'org-velocity-read)
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-03-12 17:34:52 IST</p>
<p class="author">Author: Daniel Szmulewicz</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
